---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet
source: html/04782b5e-7089-9825-459b-df47a45a0e71.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet

Represents the electrical analytical load set, it can contain a set of Electrical Analytical Equipment Loads.

## Syntax (C#)
```csharp
public class ElectricalAnalyticalLoadSet : Element
```